[문1] 아래 조건을 만족하는 Series를 생성하세요.
1) 데이터 : 1~50 범위에서 7의 배수 정수
2) 인덱스 : 'a~z' 범위에서 데이터 갯수 만큼의 알파벳
3) 타  입 : 부호가 없는 1바이트 정수
4) 이  름 : sevens
5) 속  성 : index, values, dtype, ndim, shape, size

In [14]:
import pandas as pd
import numpy as np

In [15]:
data1=[]
for a in range(1,51):
    if (a % 7) == 0:
        data1.append(a)
print(data1)
sevens=pd.Series(data1)
sevens

[7, 14, 21, 28, 35, 42, 49]

0     7
1    14
2    21
3    28
4    35
5    42
6    49
dtype: int64

In [16]:
sevens.index=['a','b','c','d','e','f','g']
sevens

a     7
b    14
c    21
d    28
e    35
f    42
g    49
dtype: int64

In [26]:
sevens=sevens.astype('uint8')

In [27]:
sevens.array

<PandasArray>
[7, 14, 21, 28, 35, 42, 49]
Length: 7, dtype: uint8

In [28]:
sevens.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [29]:
sevens.values

array([ 7, 14, 21, 28, 35, 42, 49], dtype=uint8)

In [30]:
sevens.dtype

dtype('uint8')

In [31]:
sevens.ndim

1

In [32]:
sevens.shape

(7,)

In [33]:
sevens.size

7

[문2] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : knu_data.csv
2) 인덱스 : 컬럼 중 하나를 인덱스로 설정
3) 속성 정보 출력 
4) 데이터 확인 정보 출력
5) 타입과 실제 데이터 타입 일치

In [41]:
file1='../DATA/knu_data.csv'
DF1=pd.read_csv(file1,parse_dates=['time'],index_col=['time'])
DF1

                     mem_id    team
time
2023-11-02 20:00:00  knu_21   경영지원팀
2023-11-17 20:00:00  knu_03   대외협력팀
2023-11-09 20:00:00  knu_01   대외협력팀
2022-11-22 20:00:00  knu_09   경영지원팀
2022-11-11 20:00:00  knu_01   경영지원팀

In [42]:
DF1.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 2023-11-02 20:00:00 to 2022-11-11 20:00:00
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mem_id  5 non-null      object
 1   team    5 non-null      object
dtypes: object(2)
memory usage: 120.0+ bytes

In [43]:
DF1.dtypes

mem_id    object
team      object
dtype: object

In [71]:
DF1.ndim

2

In [72]:
DF1.shape

(5, 2)

In [73]:
DF1.size

10

[문3] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stats_100701.xlsx
2) 년도별 인구가 가장 많은 지역과 가장 적은 지역 
3) 6대 광역시에서 년도별 인구가 가장 많은 지역과 가장 적은 지역 
4) 8도 중 7도에서 년도별 인구가 가장 많은 지역과 가장 적은 지역

In [76]:
file2='../DATA/stats_100701.xlsx'
DF2=pd.read_excel(file2,header=1,index_col=0)
DF2

      2015   2016   2017   2018
계    51015  51218  51362  51607
서울    9941   9843   9766   9705
부산    3452   3447   3424   3400
대구    2469   2461   2458   2450
인천    2883   2907   2924   2939
광주    1506   1502   1495   1493
대전    1542   1536   1528   1518
울산    1164   1166   1159   1154
세종     187    234    266    304
경기   12423  12600  12786  13031
강원    1517   1521   1521   1521
충북    1589   1601   1609   1619
충남    2103   2126   2153   2180
전북    1835   1835   1829   1820
전남    1797   1798   1795   1790
경북    2678   2683   2675   2674
경남    3330   3338   3339   3356
제주     599    618    635    653
수도권  25247  25350  25476  25675

In [82]:
DF2.columns

Index([2015, 2016, 2017, 2018], dtype='int64')

In [93]:
DF2.sort_values(2015,ascending=False)

      2015   2016   2017   2018
계    51015  51218  51362  51607
수도권  25247  25350  25476  25675
경기   12423  12600  12786  13031
서울    9941   9843   9766   9705
부산    3452   3447   3424   3400
경남    3330   3338   3339   3356
인천    2883   2907   2924   2939
경북    2678   2683   2675   2674
대구    2469   2461   2458   2450
충남    2103   2126   2153   2180
전북    1835   1835   1829   1820
전남    1797   1798   1795   1790
충북    1589   1601   1609   1619
대전    1542   1536   1528   1518
강원    1517   1521   1521   1521
광주    1506   1502   1495   1493
울산    1164   1166   1159   1154
제주     599    618    635    653
세종     187    234    266    304

In [103]:
DF3=DF2.loc[['부산','대구','인천','광주','대전','울산']].sort_values(2015,ascending=False)
DF3

    2015  2016  2017  2018
부산  3452  3447  3424  3400
인천  2883  2907  2924  2939
대구  2469  2461  2458  2450
대전  1542  1536  1528  1518
광주  1506  1502  1495  1493
울산  1164  1166  1159  1154

In [146]:
DF2[year].sort_values(ascending=False).index[1]

'수도권'

In [167]:
DF4=DF2.loc[['경기','경남','경북','충남','전북','전남','충북','강원']].sort_values(2015,ascending=False)
DF4.sort_values(2015,ascending=False)
DF4.pop(2015)

경기    12423
경남     3330
경북     2678
충남     2103
전북     1835
전남     1797
충북     1589
강원     1517
Name: 2015, dtype: int64

In [168]:
DF4.sort_values(2016,ascending=False).pop(2016)

경기    12600
경남     3338
경북     2683
충남     2126
전북     1835
전남     1798
충북     1601
강원     1521
Name: 2016, dtype: int64

In [170]:
DF4.sort_values(2017,ascending=False).pop(2017)

경기    12786
경남     3339
경북     2675
충남     2153
전북     1829
전남     1795
충북     1609
강원     1521
Name: 2017, dtype: int64

In [169]:
DF4.sort_values(2018,ascending=False).pop(2018)

경기    13031
경남     3356
경북     2674
충남     2180
전북     1820
전남     1790
충북     1619
강원     1521
Name: 2018, dtype: int64

In [102]:
len(DF2.index)

19

In [106]:
DF2.loc[['부산','대구','인천','광주','대전','울산']].sort_values(2015,ascending=False).iloc[len(DF3.index)-1]

2015    1164
2016    1166
2017    1159
2018    1154
Name: 울산, dtype: int64

[문4] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stock price.xlsx
2) 데이터 로딩 시 인덱스로 사용할 수 있는 컬럼 설정
3) 결측치 처리 =>  
   (가) 1개라도 NaN이면 모두 제거 / price가 NaN이면 제거 / value가 10000이하면 제거  
   (나) 평균값으로 결측치 대체, 이전/이후 값으로 결측치 대체
4) value가 1000이하 이거나 price가 90000이상인 데이터

In [152]:
file3='../DATA/stock price.xlsx'
drug=pd.read_excel(file3,index_col='id')
drug

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
138040    메리츠금융지주     827.500000       NaN
130960     CJ E&M   58540.666667   98900.0
138250      엔에스쇼핑   14558.666667   13200.0
139480        이마트  239230.833333  254500.0
142280     녹십자엠에스     468.833333   10200.0
145990        삼양사   82750.000000   82000.0
181710  NHN엔터테인먼트            NaN       NaN
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0
199800         툴젠   -2514.333333  115400.0
204210     모두투어리츠    3093.333333    3475.0
207940   삼성바이오로직스            NaN   91900.0

In [171]:
drug.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13 entries, 128940 to 207940
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   stock_name  13 non-null     object
 1   value       11 non-null     float64
 2   price       11 non-null     float64
dtypes: float64(2), object(1)
memory usage: 416.0+ bytes

In [175]:
drug.dropna(inplace=True)
drug

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
130960     CJ E&M   58540.666667   98900.0
138250      엔에스쇼핑   14558.666667   13200.0
139480        이마트  239230.833333  254500.0
142280     녹십자엠에스     468.833333   10200.0
145990        삼양사   82750.000000   82000.0
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0
199800         툴젠   -2514.333333  115400.0
204210     모두투어리츠    3093.333333    3475.0

In [178]:
drug['value']<=10000

id
128940    False
130960    False
138250    False
139480    False
142280     True
145990    False
185750    False
192400    False
199800     True
204210     True
Name: value, dtype: bool

In [183]:
drug=drug[drug['value']>=10000]
drug

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
130960     CJ E&M   58540.666667   98900.0
138250      엔에스쇼핑   14558.666667   13200.0
139480        이마트  239230.833333  254500.0
145990        삼양사   82750.000000   82000.0
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0

In [185]:
drug['value']<=1000

id
128940    False
130960    False
138250    False
139480    False
145990    False
185750    False
192400    False
Name: value, dtype: bool

In [186]:
drug['price']>=90000

id
128940     True
130960     True
138250    False
139480     True
145990    False
185750     True
192400     True
Name: price, dtype: bool

In [192]:
mask= ((drug['value']<=1000) | (drug['price']>=90000))
mask

id
128940     True
130960     True
138250    False
139480     True
145990    False
185750     True
192400     True
dtype: bool

In [193]:
drug[mask]

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
130960     CJ E&M   58540.666667   98900.0
139480        이마트  239230.833333  254500.0
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0